class Ajax {
    constructor (){
        this.xhr=new XMLHttpRequest();
        
    };
    send_post(message={'message':'undefided'}, path='', callback ){
        this.message=JSON.stringify(message);
        this.xhr.open('POST', `/system.html/${path}`, true);
        this.xhr.setRequestHeader('Content-Type', 'application/json');
        this.xhr.send(this.message);
        this.xhr.onreadystatechange = ()=> {
            if (this.xhr.readyState != 4) return;
            callback (JSON.parse(this.xhr.responseText));
    
        }  
    }
    send_get(path, callback){
        this.xhr.open('GET', `/system.html/${path}`, true);
        this.xhr.onload=()=>{
            callback(this.xhr.response);
        }
        this.xhr.send(null);
    }

}
function $(id='body'){
    return document.querySelector(id);
}
let product={'Грунтующая краска CT16':4,
    'Грунтующая краска CT15 силикон':3,
    'Штукатурка акриловая "камешковая" CT60(1,0)База 2010':2,
    'Штукатурка акриловая "камешковая" CT60(1,5)/База 2012':5,
    'Штукатурка акриловая "камешковая" CT60(2,5)/База 2012':6,
    'Штукатурка акриловая "короед"CT63(3,0)/База 2':7,
    'Штукатурка акриловая "короед" CT64(2,0)/База 2':8,
    'Штукатурка силикатная "камешковая" CT72(1,5)/База 2015':9,
    'Штукатурка силикатная "камешковая" CT72(1,5)/База 2016':10,
    'Штукатурка силикатная "камешковая" CT72(2,5)/База 2015':11,
    'Штукатурка силикатная "камешковая" CT72(2,5)/База 2016':12,
    'Штукатурка силикатная "короед" CT73(2,0)/База':13,
    'Штукатурка силикатная "короед" CT73(3,0)/База':14,
    'Штукатурка силиконовая "камешковая" CT74(1,5)/База 2015':15,
    'Штукатурка силиконовая "камешковая" CT74(1,5)/База 2016':16,
    'Штукатурка силиконовая "камешковая" CT74(2,5)/База 2015':17,
    'Штукатурка силиконовая "камешковая" CT74(2,5)/База 2016':18,
    'Штукатурка силиконовая "короед" CT75(2,0)/База':19,
    'Штукатурка силиконовая "короед" CT75(3,0)/База':20,
    'Штукатурка силикон-силикатная "камешковая" CT174(1,5)/База 2015':21,
    'Штукатурка силикон-силикатная "камешковая" CT174(1,5)/База 2016':22,
    'Штукатурка силикон-силикатная "короед" CT175(2,0)/База':23,
    'Краска фасадная структурная CT40':24,
    'Краска фасандная силиконовая CT48/База':25,
    'Краска фасадная акриловая CT42/База 2015':26,
    'Краска фасадная акриловая CT44/База 2015':27,
    'Краска фасадная криловая CT44/Белая 2015':28,
    'Краска фасадная силикатная CT54/база2005':29,
    'Краска фасадная силикатная CT54/Прозрачная база':44,
    'Краска акриловая CT50': 32,
    'Краска акриловая СT51' : 35,
    'Краска акриловая CT52/БЕЛАЯ' : 37,
    'Краска акриловая CT52/БАЗА' :  39,
    'Краска структурная CT53':      40,
    'Штукатурка фастурная элестомерная CT79(1,5)/База':41,
    'Краска силиконовая CT48/Прозрачная база': 43,
    'Краска акриловая CT44/Прозрачная база' : 44};
let pigments={
    'Пигментная паста желтая 01 (A1)': 46,
    'Пигментная паста желтая 03 (C1)': 47,
    'Пигментная паста белая 01 (D1)': 48,
    'Пигментная паста голубая 01 (E1)': 49,
    'Пигментная паста черная 02 (F1)': 50,
    'Пигментная паста голубая 02 (G1)': 51,
    'Пигментная паста красная 01 (H1)': 52,
    'Пигментная паста красная 02 (I1)': 53,
    'Пигментная паста желтая 04 (J1)': 54,
    'Пигментная паста розовая 01 (K1)': 55,
    'Пигментная паста пурпурная 01 (L1)': 56,
    'Пигментная паста фиолетовая 01 (M1)': 57,
    'Пигментная паста зеленая 02 (O1)': 58,
    'Пигментная паста зеленая 01 (P1)': 59
}

